src/test/resources/datasets/dao/payment/payment/removePaymentDataSet.yml

credit_card: []
payment_method:
  - id: 1
    value: "Card"
    key: "Card"
  - id: 2
    value: "Blik"
    key: "Blik"
payment_status:
  - id: 1
    value: "Done"
    key: "Done"
  - id: 2
    value: "Approved"
    key: "Approved"
currency:
  - id: 1
    value: "USD"
    key: "USD"
  - id: 2
    value: "EUR"
    key: "EUR"
discount:
  - id: 1
    amount: 5
    char_sequence_code: "abc"
    is_active: true
    is_percent: false
    currency_id: 1
price: []
currency_coefficient:
  - id: 1
    currency_from_id: 1
    currency_to_id: 2
    coefficient: 0.95
    date_of_create: "2024-03-03 12:00:00"
multi_currency_price_info: []
payment: []
